{
  "frontendDeveloperIntroduction": "Привет! Я Frontend-разработчица с маркетинговым бэкграундом и богатым портфолио, начиная от простых интерфейсов и заканчивая высоконагруженными React-приложениями. Мой подход к веб-разработке базируется на глубоком понимании потребностей пользователей, что помогает мне создавать удобные и интуитивно понятные интерфейсы. Работая в распределенных scrum-командах, я использую различные инструменты для эффективного управления задачами.",
  "collaborationExperience": "Стремлюсь постоянно развиваться, оставаясь в курсе передовых технологий. Моя главная цель — разрабатывать продукты, которые не только функциональны, но и приносят удовольствие пользователям.",
  "Key Skills": "Ключевые навыки",
  "Distributed Scrum Teams": "Работа в распределенных scrum-командах",
  "Project Collaboration and Management": "Совместная работа и управление проектами",
  "Let's craft together": "Давайте творить вместе",
  "Hi! I'm Nina Petrova": "Привет! Я Нина Петрова",
  "Learn more": "Узнать больше",
  "about": "обо мне",
  "projects": "проекты",
  "contacts": "контакты",
  "home": "главная",
  "projectsTexts": {
    "audio": {
      "title": "ПЛАТФОРМА АУДИОЭКСКУРСИЙ И БИЛЕТОВ: Оптимизация и улучшение UX",
      "intro": "В процессе сотрудничества я активно участвовала в расширении функциональности сайта. Сосредоточившись на создании легкого и увлекательного взаимодействия для авторов и пользователей, я внесла ряд значительных улучшений. Некоторые из них:",
      "list": {
        "0": "Внедрила удобный блок для бронирования туров и инструмент редактирования заказов, упростив покупку и расширив контроль пользователей над своими заказы;",
        "1": "Разработала страницу регистрации для авторов с интуитивно понятным процессом, предоставив им персональные инструменты управления турами;",
        "2": "Улучшила систему фильтрации продуктов, сделав поиск туров более лёгким;",
        "3": "Интегрировала аналитику через Google Tag Manager для лучшего отслеживания действий пользователей;",
        "4": "Создала страницу отзывов, чтобы пользователи могли делиться своим мнением;",
        "5": "Внедрила эффективную функцию сжатия изображений, что существенно повысило производительность сайта;",
        "6": "Поддерживала функционал мультиязычности (i18n), расширяя доступность сервиса;",
        "7": "Менторила коллегу-джуниора, способствуя созданию дружественной атмосферы в команде."
      }
    },
    "digital": {
      "title": "САЙТ МАРКЕТИНГОВОГО АГЕНТСТВА: Совершенство в каждой детали",
      "intro": "Проект стал воплощением креативности в сочетании с функциональностью. Благодаря совместрой работе с дизайнером и менеджером агентства, а также вниманию к деталям, я смогла полностью воплотить задуманное и превзойти все ожидания",
      "list": {
        "0": "Сверстала сайт в соответствии с индивидуальным дизайном из Figma, обеспечив идеальное воплощение видения агентства;",
        "1": "Интегрировала сайт с WordPress, предоставив возможность простого управления контентом;",
        "2": "Реализовала мультиязычные версии сайта, чтобы быть ближе к разнообразной аудитории;",
        "3": "Внедрила reCAPTCHA для предотвращения автоматических запросов;",
        "4": "Настроила отправку и редирект писем из форм заявок сайта, упрощая взаимодействия с клиентами;",
        "5": "Создала и подключила SSL-сертификаты для повышения доверия и надежности."
      }
    },
    "nft": {
      "title": "ВЕБ-САЙТ ГЕНЕРАТОРА NFT: Рефакторинг и редизайн",
      "intro": "Веб-сайт не обладал необходимой функциональностью и содержал устаревший код, что создавало преграды для его развития. Мои усилия привели к значительным изменениям, которые не только решили бизнес-задачи, но также улучшили пользовательский опыт. Некоторые из моих достижений:",
      "list": {
        "0": "Провела успешную миграцию проекта на React, заменив старые JS + jQuery, что существенно расширило его возможности и улучшило производительность;",
        "1": "Оптимизировала передачу данных через Fetch API для генерации и масштабирования изображений;",
        "2": "Устранила избыточность кода за счет ввода переиспользуемых компонентов;",
        "3": "Реализовала новый дизайн для улучшения визуальной привлекательности и общего впечатления пользователей;",
        "4": "Внедрила CSS Modules для более простого управления стилями."
      }
    },
    "cats": {
      "title": "КОШАЧЬИ ПРЯТКИ: Многоуровневая мини-игра, сделанная с любовью",
      "intro": "Мой дебютный проект, который стал для меня воротами в мир JavaScript. В процессе создания этой простой, но очаровательной браузерной игры, я черпала вдохновение из своих детских воспоминаний о Морском бое. В моей версии игры пользователь не сражается с противниками - вместо этого он открывает коробки, в которых спрятаны милые котята. Ключевые моменты",
      "list": {
        "0": "Адаптивный дизайн для игры на различных устройствах;",
        "1": "Взаимодействие с интерактивными элементами DOM при помощи JS;",
        "2": "Динамика посредством CSS-анимации."
      },
      "conclusion": "Загляните на сайт, чтобы найти всех котят:"
    }
  },
  "My favorite projects": "Избранные проекты",
  "VIEW SITE": "посмотреть",
  "Nina Petrova | Frontend Developer Portfolio": "Нина Петрова | Frontend Developer Portfolio"
}
